Revit 2026 API

# SystemZoneData Class

---

Represents the specific domain requirements for a system-zone used in MEP design.

SystemObject Autodesk.Revit.DB.AnalysisGenericZoneDomainData Autodesk.Revit.DB.MechanicalSystemZoneData

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SystemZoneData : GenericZoneDomainData
```
```vb
Public Class SystemZoneData
	Inherits GenericZoneDomainData
```
```cpp
public ref class SystemZoneData : public GenericZoneDomainData
```
```fsharp
type SystemZoneData =
    class
        inherit GenericZoneDomainData
    end
```

The SystemZoneData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from GenericZoneDomainData) |
|  | ZoneEquipmentId | The id of the zone equipment related to the zone. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a system-zone data domain class. |
|  | Dispose | (Inherited from GenericZoneDomainData) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A system-zone is used to specify what parts of a building are served by specific equipment, air systems and water loops without having to physically model them. A system-zone is represented as a GenericZone element with a domain data of type SystemZoneData, which contains specific domain requirements for the purpose of analysis.

#### Reference

Autodesk.Revit.DB.Mechanical Namespace